railes/app/controllers/angelitopros_controller.rb

  def index
    @angelitopros = Angelitopro.all
---
SELECT "angelitopros".* FROM "angelitopros"