railes/app/controllers/chocolates_controller.rb

SELECT "chocolates".* FROM "chocolates"
---
  def index
    @chocolates = Chocolate.all

INSERT INTO "chocolates" ("name", "apellido", "edad", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "fbfjf"], ["apellido", "mm"], ["edad", 15], ["email", ""], ["created_at", "2021-07-27 02:22:22.246348"], ["updated_at", "2021-07-27 02:22:22.246348"]]
---
  def create
    @chocolate = Chocolate.new(chocolate_params)

    respond_to do |format|
      if @chocolate.save

SELECT "chocolates".* FROM "chocolates" WHERE "chocolates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_chocolate
      @chocolate = Chocolate.find(params[:id])