railes/app/controllers/luis_controller.rb

  def index
    @luis = Lui.all
---
SELECT "luis".* FROM "luis"

  def create
    @lui = Lui.new(lui_params)

    respond_to do |format|
      if @lui.save
---
INSERT INTO "luis" ("name", "apellido", "edad", "email", "contrasena", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "andrea"], ["apellido", "cerda"], ["edad", 15], ["email", "loco"], ["contrasena", "dos"], ["created_at", "2021-07-21 02:02:03.776977"], ["updated_at", "2021-07-21 02:02:03.776977"]]

    def set_lui
      @lui = Lui.find(params[:id])
---
SELECT "luis".* FROM "luis" WHERE "luis"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]