railes/app/controllers/nuevos_controller.rb

  def index
    @nuevos = Nuevo.all
---
SELECT "nuevos".* FROM "nuevos"