railes/app/controllers/perros_controller.rb

SELECT "perros".* FROM "perros"
---
  def index
    @perros = Perro.all

INSERT INTO "perros" ("name", "apellido", "edad", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "ff"], ["apellido", "bbb"], ["edad", 20], ["email", "mmm"], ["created_at", "2021-07-26 01:57:41.820403"], ["updated_at", "2021-07-26 01:57:41.820403"]]
---
  def create
    @perro = Perro.new(perro_params)

    respond_to do |format|
      if @perro.save

SELECT "perros".* FROM "perros" WHERE "perros"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_perro
      @perro = Perro.find(params[:id])