railes/app/controllers/tortugas_controller.rb

  def index
    @tortugas = Tortuga.all
---
SELECT "tortugas".* FROM "tortugas"