railes/app/controllers/usuarios_controller.rb

  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("nombre", "apellido", "edad", "email", "contrasena", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)